Revit 2027 API
GroupTypeId.EnergyAnalysisBldgConsMtlThermalProps Property
 Material Thermal Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisBldgConsMtlThermalProps { get; }
Public Shared ReadOnly Property EnergyAnalysisBldgConsMtlThermalProps As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisBldgConsMtlThermalProps {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisBldgConsMtlThermalProps : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace